{ 
  "Life": {
    "High": [
      "Had to rush my mother to the hospital due to a sudden health issue.",
      "My child had a high fever, and I had to take care of them.",
      "There was a medical emergency in the family that needed immediate attention.",
      "My father had a minor accident, and I had to assist him.",
      "A close relative passed away, and I had to attend the funeral.",
      "My house was flooded due to heavy rains, and I had to manage the situation.",
      "There was a fire in the neighborhood, and we had to evacuate.",
      "My grandmother fell ill suddenly, and I had to be with her.",
      "Our apartment building had a gas leak, and we were asked to vacate.",
      "I had to accompany a family member for an urgent medical procedure.",
      "My pet was seriously ill, and I had to take it to the vet.",
      "There was a burglary attempt at home, and I had to file a police report.",
      "My sibling met with an accident, and I had to be at the hospital.",
      "We had a sudden power outage, and I had to ensure the safety of my family.",
      "My neighbor had a medical emergency, and I was the only one available to help.",
      "I had to attend a court hearing related to a family dispute.",
      "There was a water pipeline burst at home, causing severe flooding.",
      "My spouse had a health scare, and I had to rush them to the doctor.",
      "I had to attend an urgent parent-teacher meeting for my child.",
      "There was a short circuit at home, and I had to manage the repairs.",
      "My child had an allergic reaction, and I had to take them to the hospital.",
      "Our building elevator malfunctioned, and my elderly parent was stuck.",
      "I had to assist in a community emergency response due to local flooding.",
      "My relative was hospitalized, and I had to arrange for blood donation.",
      "There was a sudden lockdown in our area due to a health scare.",
      "I had to travel urgently to my hometown due to a family crisis.",
      "My child went missing briefly, and I had to coordinate with the police.",
      "There was a fire in our kitchen, and I had to handle the situation.",
      "My spouse met with a minor accident, and I had to be at the hospital.",
      "I had to attend a mandatory health check-up scheduled by the government.",
      "Our house was broken into, and I had to file a police complaint.",
      "My parent had a fall, and I had to ensure they received medical attention.",
      "There was a gas cylinder leak at home, and I had to manage the emergency.",
      "I had to assist a neighbor who had a stroke until help arrived.",
      "My child was involved in a school accident, and I had to be there.",
      "There was a sudden curfew imposed in our area due to unrest.",
      "I had to attend a critical meeting regarding my child's education.",
      "My family was involved in a road accident, and I had to be at the scene.",
      "There was a snake in our house, and I had to call for removal services.",
      "I had to take my parent for an emergency dialysis session.",
      "Our house was struck by lightning, causing significant damage.",
      "I had to manage the relocation of my family due to structural damage at home.",
      "My sibling had a mental health crisis, and I had to support them.",
      "There was a sudden outbreak of illness in our area, and I had to ensure safety.",
      "I had to attend a legal proceeding related to a family matter.",
      "Our car broke down in a remote area, and I had to arrange for towing.",
      "I had to assist in the evacuation of our building due to a bomb threat.",
      "My child had a severe asthma attack, and I had to rush them to the ER.",
      "There was a chemical spill near our residence, and we had to evacuate.",
      "I had to coordinate emergency services for a neighbor in distress.",
      "Our water tank burst, flooding the house, and I had to manage the cleanup.",
      "I had to attend a sudden counseling session for my child's behavioral issues.",
      "There was a landslide near our home, and we had to relocate temporarily.",
      "My spouse had a panic attack, and I had to be with them.",
      "I had to manage the sudden hospitalization of a close friend.",
      "There was a major power surge that damaged appliances, and I had to handle repairs.",
      "I had to attend a government-mandated health screening.",
      "Our building was sealed due to a health hazard, and I had to find alternate accommodation.",
      "I had to assist in the rescue of animals stranded due to flooding.",
      "My parent had a diabetic emergency, and I had to administer first aid.",
      "There was a sudden termite infestation, and I had to oversee pest control.",
      "I had to manage the relocation of elderly relatives due to unsafe conditions.",
      "Our neighborhood was cordoned off due to a police investigation.",
      "I had to attend a critical therapy session for my mental health.",
      "There was a structural collapse in our building, and I had to ensure family safety.",
      "I had to assist in the delivery of a neighbor's baby due to lack of transport.",
      "My child had a seizure, and I had to provide immediate care.",
      "There was a gas station explosion nearby, and we had to evacuate.",
      "I had to manage the sudden death of a close family friend.",
      "Our house was infested with bees, and I had to call for removal services.",
      "I had to attend a sudden intervention for a family member's addiction.",
      "There was a major sewage leak at home, causing health hazards.",
      "I had to assist in the care of a neighbor's child due to their hospitalization.",
      "Our area was hit by a tornado, and I had to ensure family safety.",
      "I had to attend a sudden mediation session for a family dispute.",
      "There was a sudden outbreak of food poisoning in our household.",
      "I had to manage the emergency relocation of pets due to flooding.",
      "Our building's water supply was contaminated, and I had to arrange alternatives.",
      "I had to assist in the rescue of stranded individuals during a storm.",
      "My spouse had a severe allergic reaction, and I had to rush them to the hospital.",
      "There was a sudden sinkhole near our home, and we had to evacuate.",
      "I had to attend a critical financial meeting regarding family assets.",
      "Our home was invaded by wild animals, and I had to call forest officials.",
      "I had to manage the sudden collapse of our home's ceiling.",
      "There was a chemical fire nearby, and we had to evacuate immediately.",
      "I had to assist in the emergency delivery of a relative's baby.",
      "Our building's foundation was compromised, and we had to relocate.",
      "I had to attend a sudden court-mandated counseling session.",
      "There was a flash flood in our area, and I had to ensure family safety.",
      "I had to manage the sudden hospitalization of my in-laws.",
      "Our house was struck by a falling tree, causing significant damage.",
      "I had to attend a sudden intervention for a friend's mental health crisis.",
      "There was a major landslide blocking our only access road.",
      "I had to assist in the evacuation of a nearby school due to a bomb threat.",
      "Our neighborhood experienced a gas explosion, and we had to evacuate.",
      "I had to manage the sudden death of a pet, which deeply affected my child.",
      "There was a sudden outbreak of dengue in our area, and I had to ensure precautions.",
      "I had to attend a critical meeting regarding my child's special education needs.",
      "Our home was infested with snakes, and I had to call for professional help.",
      "I had to assist in the emergency care of a neighbor's elderly parent.",
      "There was a sudden outbreak of fire in our building's parking area.",
      "I had to manage the sudden collapse of our home's staircase.",
      "Our area was declared a containment zone, and we had to follow protocols.",
      "I had to attend a sudden legal proceeding regarding property disputes.",
      "There was a sudden outbreak of illness in our family, requiring immediate care.",
      "I had to assist in the emergency relocation of a friend's family due to flooding.",
      "Our building's roof collapsed due to heavy rains, and I had to manage repairs.",
      "I had to attend a sudden therapy session for my child's behavioral issues.",
      "There was a sudden outbreak of food poisoning in our neighborhood.",
      "I had to manage the emergency care of a neighbor's injured pet.",
      "Our area was hit by an earthquake, and I had to ensure family safety.",
      "I had to attend a critical meeting regarding my parent's medical treatment.",
      "There was a sudden outbreak of fire in our kitchen, causing significant damage.",
      "I had to assist in the emergency care of a friend's injured child.",
      "Our building's elevator collapsed, causing injuries, and I had to assist.",
      "I had to manage the sudden hospitalization of a close colleague.",
      "There was a sudden outbreak of illness in our office, requiring immediate action.",
      "I had to attend a sudden intervention for a friend's addiction issues.",
      "Our neighborhood experienced a major power outage, causing disruptions.",
      "I had to assist in the emergency care of a neighbor's injured pet."
    ],
    "Medium": [
      "Overslept due to a late-night family function.",
      "Missed the bus because it arrived earlier than usual.",
      "Had to drop my child at school as their regular transport was unavailable.",
      "Got stuck in traffic due to a political rally.",
      "Had to wait for the milkman who was running late.",
      "My scooter had a flat tire, and I had to walk to the repair shop.",
      "Lost track of time while helping my neighbor with groceries.",
      "Had to attend an unexpected parent-teacher meeting.",
      "My phone battery died, and I missed my alarm.",
      "Had to accompany my spouse to a doctor's appointment.",
      "Missed the train due to a longer-than-usual queue at the ticket counter.",
      "Had to wait for the plumber to fix a leaking pipe.",
      "Got delayed due to a sudden downpour.",
      "Had to help a friend who was locked out of their house.",
      "Missed my regular bus due to festival traffic.",
      "Had to take my pet to the vet for a vaccination.",
      "My internet stopped working suddenly and I had to call the technician.",
      "Got caught up in a surprise family visit.",
      "Was fasting and felt dizzy, so needed to rest a bit.",
      "Had to accompany my parent for a routine check-up.",
      "There was a water supply issue at home, had to handle it immediately.",
      "My gas cylinder got over while cooking breakfast.",
      "Had to deal with an unexpected power cut while getting ready.",
      "My child had an exam and needed help revising last-minute.",
      "Got held up while collecting a courier from the delivery point.",
      "Lost my wallet and had to go back home to get spare money/cards.",
      "Auto rickshaw broke down halfway and I had to walk the rest.",
      "The maid didn’t show up, and I had to manage house chores.",
      "There was a local protest, and roads were blocked.",
      "Had to attend a quick community meeting in our apartment society.",
      "Received a last-minute call from my in-laws asking for help.",
      "There was an unexpected pooja at home.",
      "Had to take my child to their tuition class on short notice.",
      "Got held up at the bank due to a long queue.",
      "Wasn't feeling well after eating something spicy last night.",
      "Had to drop off a relative at the railway station.",
      "My laundry got delayed due to no sun/dryer malfunction.",
      "The ceiling fan stopped working, and I had to get it fixed immediately.",
      "Had to buy groceries urgently for lunch preparation.",
      "There was a birthday celebration at home that extended unexpectedly.",
      "My phone screen broke, and I had to get it replaced quickly.",
      "Had to help set up for a small family get-together.",
      "My building lift was not working, and I stay on the 7th floor.",
      "Had to wait for the carpenter to fix our broken door.",
      "Missed my morning alarm due to low phone volume.",
      "Was waiting for an urgent courier delivery at home.",
      "Had to take my parent to a government office for document work.",
      "Got caught in a local temple procession.",
      "Had to clean up after my pet made a mess at home.",
      "There was sudden loud construction work next door causing delay.",
      "Had to fix a leaking faucet urgently before leaving.",
      "My mobile data ran out, and I had to recharge before stepping out.",
      "Got caught in a surprise inspection in my housing society.",
      "Had to wait for my sibling to return home with the only vehicle.",
      "Had to deal with a lizard in the kitchen!",
      "My street was closed due to a wedding procession.",
      "My spectacles broke and I had to use tape to fix it temporarily.",
      "Had to help my spouse prepare for an online interview.",
      "Our building had pest control scheduled suddenly.",
      "Got stuck because a cow was blocking the street (typical in many areas).",
      "Had to help a neighbor lift their heavy luggage upstairs.",
      "My kitchen gas pipe was loose, and I had to wait for the repairman.",
      "Missed the metro due to longer-than-usual baggage checks.",
      "Had to take my parent to collect pension from the post office.",
      "Had to accompany a relative to a temple ritual early morning.",
      "I dropped my house keys in the drain and had to fish them out.",
      "Had to be home to receive my new fridge delivery.",
      "Our water tank overflowed, and I had to shut it off quickly.",
      "The electrician was scheduled, and I had to supervise.",
      "A child in our building got hurt, and I stayed to help.",
      "Had to get a duplicate key made after locking myself out.",
      "My new furniture arrived, and I had to supervise the setup.",
      "Got stuck because the autorickshaw driver wanted exact change.",
      "Had to wait for the milk to boil or it would have overflowed.",
      "Had to chase the dog who ran out the gate unexpectedly.",
      "My power backup inverter started beeping loudly and needed a reset.",
      "The house was too messy from last night’s guests and I had to clean up.",
      "Had to take a relative to the vaccination center.",
      "I got sprayed by a passing vehicle in the rain and had to change clothes.",
      "The traffic police stopped us for a routine check and delayed us.",
      "I had to find and catch the hens that escaped our backyard coop.",
      "My neighbor's power tripped and I helped them check the fuse.",
      "My umbrella broke mid-way and I got drenched—needed to change.",
      "My pressure cooker was about to blow, had to wait for it to settle.",
      "Had to get a duplicate Aadhaar card printed urgently.",
      "Had to set up the online grocery delivery for my parent.",
      "Got stuck in a lift during a short power cut.",
      "Was guiding the plumber to the correct apartment from the gate.",
      "My younger sibling locked themselves in the bathroom by mistake.",
      "Had to help my aunt download and submit an online application.",
      "Our building watchman was sick, and I had to take over gate duty for a while.",
      "Had to arrange emergency recharge for a prepaid home electricity meter.",
      "My phone was updating and I couldn’t use it for navigation.",
      "Had to translate a local government notice for my parents.",
      "Was stuck helping kids prepare for their school project presentation.",
      "Had to fix a loose window shutter before the wind blew it open again.",
      "My pet hid my keys, and it took time to find them.",
      "My mother made breakfast and I had to stay and finish it out of respect.",
      "Our house had too many visitors in the morning for me to leave early.",
      "The water pump wouldn't start, and I had to call for help.",
      "Had to get my watch battery replaced urgently as it stopped working.",
      "Had to put rangoli outside the house for a sudden religious event.",
      "Got drenched during a morning walk and needed to change.",
      "Was giving directions to a lost delivery guy for 20 minutes.",
      "Had to update my Digilocker documents on my parent’s phone."
    ],
    "Low": [
      "I got stuck watching a YouTube short that turned into an hour-long binge.",
      "My slippers broke mid-walk and I had to hop home.",
      "I was waiting for my chai to cool down – it was too hot to gulp.",
      "I couldn't find matching socks and had a mini crisis.",
      "The cat stole my earphones. Again.",
      "I was busy finding the remote which was under the pillow all along.",
      "I burned my toast and had to start breakfast all over again.",
      "I was distracted trying to find the source of a mysterious smell in the kitchen.",
      "My phone fell behind the bed and it took ages to retrieve.",
      "I was trying to swat a mosquito and ended up spilling my water.",
      "I was arguing with my cousin over who left the lights on.",
      "I was waiting for my laundry to finish because it was only 2 minutes left… 15 minutes ago.",
      "I started organizing my bookshelf and couldn’t stop halfway.",
      "I stepped into wet floor just after mopping and had to re-clean.",
      "I couldn’t leave without watching the last over of the cricket match.",
      "My plant looked sad so I spent time trying to cheer it up.",
      "I spent too long choosing the right meme for a group chat.",
      "I accidentally wore my t-shirt inside out and had to change.",
      "I dropped my biscuit into my tea and it was a whole mission to clean it up.",
      "My sibling hid the TV remote just to prank me.",
      "My pet sat on my clothes and I didn’t want to disturb it.",
      "I was trying to find a Wi-Fi signal in the only corner of the room where it works.",
      "I dropped my phone on my face and needed time to recover emotionally.",
      "I spent too long deciding what to wear and ended up wearing yesterday's clothes.",
      "I was reenacting a Bollywood scene in the mirror and lost track of time.",
      "I got locked in the bathroom… on purpose… for peace.",
      "I was trying to make the perfect dosa and messed up four times.",
      "I was scrolling through Swiggy just for fun and suddenly got hungry.",
      "My shoelace came undone every 5 minutes and I gave up.",
      "I was trying to convince a gecko to leave my room.",
      "I tried to clean one corner of the room and ended up deep-cleaning the whole house.",
      "I was having an emotional breakdown over my favorite character’s death in a series.",
      "I got stuck trying to open a stubborn jam jar.",
      "I couldn't leave before finishing the riddle on the milk packet.",
      "I was listening to my mom's 'quick' story that lasted half an hour.",
      "I got carried away with arranging my wardrobe by color.",
      "I was busy explaining memes to my uncle who didn’t understand them.",
      "I lost one of my ear studs and searched the entire house.",
      "I was doing yoga and forgot what time it was during savasana.",
      "I started cleaning my specs and ended up cleaning all the mirrors.",
      "I was stuck in a serious debate on whether Maggi takes 2 or 10 minutes.",
      "I was watching my ceiling fan rotate and zoned out.",
      "My hair looked weird and I spent too long fixing it.",
      "I was updating my WhatsApp status and got lost in old photos.",
      "My mobile wallpaper didn’t look right, so I kept changing it.",
      "I was too busy staring at the rain with a cup of chai.",
      "I was trying to shoo a fly out the window and it wouldn’t leave.",
      "I started watching Insta reels and time dissolved.",
      "My kurta button popped out and I had to quickly stitch it.",
      "I got stuck deciding whether to wear chappals or shoes.",
      "I spilled water while filling the bottle and had to wipe the whole floor.",
      "I walked into a cobweb and went into ninja mode for 10 minutes.",
      "I was trying to teach my parrot to say ‘Namaste’.",
      "I was brushing my teeth and got lost in thought.",
      "I spent 20 minutes trying to find my phone... it was in my hand.",
      "I was busy watching ants carry food across the floor.",
      "I dropped a coin and it rolled under the fridge.",
      "My alarm rang, but I couldn’t find the phone because it fell under my blanket.",
      "I was stuck trying to find the perfect Instagram caption.",
      "I tried to walk my dog, but he sat down mid-road in protest.",
      "I was debating with myself whether I should eat a banana or apple.",
      "I slipped on my own freshly cleaned floor.",
      "My jeans wouldn’t dry and I didn’t want to wear formal pants.",
      "I was on a mission to find that one missing sock from laundry.",
      "My neighbor’s Wi-Fi was stronger than mine and I was trying to connect.",
      "I got trapped in a phone call with an aunt I couldn’t cut short.",
      "I was trying to hide from a relative who came unannounced.",
      "My mood needed 15 extra minutes to cooperate.",
      "I had a staring contest with my cat – she won.",
      "I started watching old family wedding videos and got too nostalgic.",
      "I got stuck in the loop of ‘just one more scroll’.",
      "I was Googling ‘how to get more productive’ for half an hour.",
      "I had to fix a crooked photo frame – for 25 minutes.",
      "I spent too long pretending to be asleep to avoid housework.",
      "I had to peel pomegranates because no one else wanted to.",
      "I made tea but forgot to drink it and had to reheat – twice.",
      "I was checking horoscope compatibility out of boredom.",
      "I accidentally wore mismatched shoes and had to come back.",
      "I lost track of time folding plastic covers under the sink.",
      "I was trying to fix the tube light flicker by staring at it.",
      "I dropped a piece of papad behind the fridge.",
      "I spent time calculating how many hours I waste daily.",
      "I was on a mission to get the perfect selfie with my pet.",
      "I was watching the rain splash in puddles for inspiration.",
      "I kept reheating my tea until it evaporated.",
      "I tried fixing a tangled charging cable and it took forever.",
      "I was rearranging the fridge just to fit one bottle.",
      "I was mentally rehearsing how to say ‘no’ but didn’t get there.",
      "My phone was under the pillow and I couldn’t hear it ring.",
      "I was trying to take the perfect photo of my food before eating.",
      "I was staring at the ceiling fan and contemplating life.",
      "I got too comfortable and decided to snooze in a towel after a shower.",
      "I tried to eat a mango mess-free. It didn’t go well.",
      "I dropped pickle oil on my shirt and had to change outfits.",
      "I was caught up laughing at an old text thread with friends.",
      "I kept checking Zomato just to read food reviews.",
      "I was syncing my playlist to my vibe… for way too long.",
      "I fell into a 'Google spiral' trying to know why crows caw at night.",
      "I tried styling my hair like Shah Rukh Khan. It didn’t work.",
      "I wanted to wear my lucky shirt but it was in the laundry.",
      "I took too long trying to click a photo of my chai with steam."
    ]
  },
  "Work": {
    "High": [
      "There was a sudden medical emergency at home.",
      "My father was hospitalized this morning and I had to be with him.",
      "There was a power outage in my area due to maintenance work.",
      "I had to take my mother for a last-minute doctor's appointment.",
      "My child fell sick and I had to rush to the school to pick them up.",
      "A close relative passed away and I had to attend the rituals.",
      "The internet provider in my area had a major breakdown.",
      "Heavy rains in my locality caused flooding and I couldn’t leave home.",
      "I was involved in a minor road accident and needed medical attention.",
      "There was a fire in a nearby apartment and we had to evacuate.",
      "My mobile network was down, making remote work impossible.",
      "I had a severe migraine and couldn’t focus on the screen.",
      "There was a gas leak reported in my building and I had to stay back for safety inspection.",
      "My laptop crashed and wouldn’t boot even after several attempts.",
      "My elderly neighbor collapsed and I had to assist until help arrived.",
      "My area was declared a containment zone due to a COVID outbreak.",
      "I was facing persistent fever and advised to rest by my doctor.",
      "My bike broke down en route and I had to get it towed.",
      "There was a protest nearby, and roads were blocked.",
      "My system was undergoing OS updates and locked me out.",
      "The water tank burst in my flat and I had to handle the flooding.",
      "I was feeling severe back pain due to a slipped disc and couldn’t sit long.",
      "There was a local curfew imposed due to political unrest.",
      "My spouse met with a minor accident and I had to accompany her to the hospital.",
      "My apartment had a pest control treatment scheduled which couldn’t be postponed.",
      "My aunt had a fall and no one else was home to help her.",
      "There was a landslide en route and traffic was diverted.",
      "I was facing eye strain and my optometrist advised rest from screens.",
      "My apartment had a short circuit and I had to call the electrician immediately.",
      "I had a dentist emergency with unbearable pain last night.",
      "There was a family dispute that required my presence urgently.",
      "My grandfather fell unconscious early morning, and we had to take him to the hospital.",
      "I lost a close family member and needed time off for the funeral rites.",
      "The elevator in my building was under repair and I had to help a senior neighbor.",
      "There was a snake spotted in my home and we had to wait for wildlife rescue.",
      "I was the only available person to accompany my sibling for their visa appointment.",
      "My driving license expired and I got pulled over by the traffic police.",
      "There was a fault in the main electricity line and my whole block was affected.",
      "My father-in-law had a stroke and was rushed to the ICU.",
      "My child had a school emergency and I was asked to come in immediately.",
      "There was a theft attempt at our home and we had to file an FIR.",
      "I had to accompany a friend who was in an emotionally unstable state.",
      "A transformer burst near our colony and it led to prolonged blackout.",
      "My system was hacked, and I had to report it to IT support immediately.",
      "I had to undergo a sudden lab test for a potential health issue.",
      "The ceiling of my flat started leaking and we had to call emergency maintenance.",
      "My banking credentials were compromised and I had to block my cards.",
      "My home was undergoing fumigation after a pest scare.",
      "I witnessed a hit-and-run accident and had to report it as a witness.",
      "My pet had a seizure and I had to rush him to the vet.",
      "There was a medical emergency with my cousin who lives alone nearby.",
      "I was stuck in a lift for an hour and got delayed.",
      "I had to be present for a legal document signing at the notary’s office.",
      "My younger sibling got injured while playing and needed stitches.",
      "There was waterlogging outside my house due to heavy rains.",
      "My car got stuck in an underpass during monsoon flooding.",
      "I had an allergic reaction and couldn’t risk stepping out without medication.",
      "My spouse lost consciousness due to low blood pressure and I had to assist.",
      "A fire broke out at a nearby warehouse causing chaos in our locality.",
      "I had to appear for an emergency court hearing related to a property dispute.",
      "There was a cyber fraud on my account and I had to visit the bank.",
      "I was caught up at the hospital attending to my diabetic parent.",
      "My landlord suddenly called for a flat inspection due to complaints from neighbors.",
      "There was a gas pipeline repair in the area and all flats were temporarily evacuated.",
      "My neighbor suffered a stroke and there was no one else to help.",
      "I was called urgently to my hometown due to a family emergency.",
      "I had an asthma flare-up and couldn’t breathe properly.",
      "I had to coordinate police verification for my passport process.",
      "I had to attend a parent-teacher meeting urgently due to a school call.",
      "My friend's mother had a fall and I was the only one nearby to help.",
      "My Aadhaar biometric update appointment couldn’t be rescheduled.",
      "There was a marriage alliance meeting arranged by my family that I couldn’t skip.",
      "I had to travel urgently to collect important legal papers from the registrar.",
      "My housemaid didn’t turn up and I had to manage household duties alone.",
      "I had to visit the RTO due to license renewal deadline.",
      "A ceiling fan fell in the living room and we had to shut off power urgently.",
      "My colony had a sewage overflow and we had to call the municipality.",
      "My glasses broke and I couldn’t see the screen clearly.",
      "My child was stuck in a school bus that broke down mid-route.",
      "The water motor burned out and we had no water in the house.",
      "My laptop adapter was sparking and unsafe to use.",
      "There was a marriage in the family that I had to help organize.",
      "The local cable broadband went down due to ongoing civic work.",
      "There was an elderly person's funeral in our building and I had to assist.",
      "I had to take my spouse for an emergency blood test.",
      "I slipped in the bathroom and had a minor head injury.",
      "There was a heavy thunderstorm and it damaged our main electric panel.",
      "The local health department was doing door-to-door inspection and needed ID proof.",
      "My mobile screen cracked and I had to get it repaired to continue work.",
      "I had to attend a video court hearing related to land documentation.",
      "My sibling missed their entrance exam due to travel issues and needed support.",
      "The rainwater entered my house and I had to manage the cleanup.",
      "I had to go to the police station to sign as a witness in a case.",
      "My relative visiting from another state got sick and I was the only help.",
      "A bee hive was discovered in our balcony and required urgent removal.",
      "I had a power surge that fried my router and modem.",
      "I had a verified COVID exposure and had to isolate until tested.",
      "My building was sealed by municipal authorities for sanitation.",
      "There was a nearby gas station fire and roads were closed temporarily.",
      "My doctor's appointment was prepone due to cancellation of another patient.",
      "My child had a panic attack due to exam stress and I had to be home.",
      "My neighborhood was undergoing water pipeline repair and there was no supply."
    ],
    "Medium": [
      "My system froze just as I was about to submit the report.",
      "I had some urgent personal calls that I couldn’t postpone.",
      "The internet speed was too slow to work effectively.",
      "I was caught in a traffic jam caused by a religious procession.",
      "I spilled coffee on my keyboard and had to clean it up.",
      "There was an unplanned power cut in my area.",
      "I had to fix an urgent home appliance issue, like a water heater.",
      "I was dealing with a plumbing issue that couldn’t wait.",
      "I missed the meeting because I got caught up in a video call with family.",
      "I had a sudden visitor at home and couldn’t avoid the interaction.",
      "I couldn’t log in to the system due to a password issue.",
      "I had to assist a colleague with a technical issue that caused a delay.",
      "I was waiting for an important document delivery at home.",
      "I couldn’t attend the meeting because of a scheduled medical test.",
      "I had a small power outage in my office/home setup.",
      "I was caught in a traffic jam due to a local strike.",
      "I couldn’t get a taxi or auto due to the rainy weather.",
      "My laptop was running updates and I couldn’t access it.",
      "There was a minor emergency at home that I needed to attend to.",
      "I couldn’t connect to the VPN at the start of my shift.",
      "I was unable to attend the meeting due to an overlapping commitment.",
      "I had some work-related paperwork that took longer than expected.",
      "My system was rebooting due to an auto-update and I couldn’t access it.",
      "There was a delay in the courier delivering important documents.",
      "I had a family member visiting who needed immediate attention.",
      "I misplaced a document that I had to track down before continuing.",
      "I had to take a quick break due to eye strain from too much screen time.",
      "My internet router was malfunctioning, and it took time to fix.",
      "I was caught up with last-minute revisions for a presentation.",
      "I was trying to troubleshoot an issue with the office printer.",
      "I couldn’t log into my work account due to a system glitch.",
      "I had to step out to attend a local errand that got delayed.",
      "I was on a call with tech support to fix a work-related issue.",
      "I had a short nap break and lost track of time.",
      "I couldn’t attend the meeting because I was assisting a family member.",
      "I had to finish up a quick home task that required my immediate attention.",
      "There was a last-minute delay in the delivery of a package I needed.",
      "I couldn’t make the meeting on time due to a late start with another task.",
      "I had to resolve an issue with my home office setup.",
      "There was some noise disturbance in my area that caused distractions.",
      "I couldn’t get the necessary documents from a colleague on time.",
      "I was trying to resolve a slow internet connection issue.",
      "I was helping a neighbor with a small household problem.",
      "My Wi-Fi connection was down for a bit this morning.",
      "I couldn’t find the files I needed on my computer.",
      "There was an impromptu call from a family member that lasted longer than expected.",
      "I was troubleshooting an error on my work device.",
      "I was attending to an issue with the office air conditioning.",
      "I needed to step out for a quick errand during the workday.",
      "I couldn’t make the meeting because I was assisting a junior colleague.",
      "There was an unexpected call regarding personal business that delayed me.",
      "I was waiting for my computer to finish an update before I could start work.",
      "I had a minor health issue that I needed to rest from for a short while.",
      "I was caught in a sudden downpour and got delayed.",
      "I was helping my neighbor set up their Wi-Fi.",
      "My mobile phone had no charge, and I couldn’t reach my work contacts.",
      "I had to adjust my work schedule because of some sudden personal appointments.",
      "I was troubleshooting a connectivity issue with the company network.",
      "I had to step out briefly for an important phone call.",
      "I was finishing up a document for someone else that took longer than expected.",
      "My office headset had a technical issue and I had to resolve it.",
      "I had to step out to grab something urgent from a nearby store.",
      "I missed the meeting because I got caught in a local event’s crowd.",
      "I lost track of time while finishing a pending task.",
      "I was working on resolving a system crash and couldn’t attend the call.",
      "I was running a few errands that took longer than planned.",
      "I had a short delay due to a personal issue that needed my attention.",
      "I had to wait for my partner to return home to take care of a family situation.",
      "I was troubleshooting an issue with the company’s software update.",
      "I had a minor technical issue with my work device that took longer to fix.",
      "I was finishing some last-minute documentation for a client.",
      "I got delayed while waiting for a service technician at home.",
      "I had an issue with my work email, and it took some time to resolve.",
      "I had a family obligation that ran over the expected time.",
      "My internet service provider had a brief outage in my area.",
      "I had a phone call that ran longer than expected with a colleague.",
      "I was coordinating with the courier service for an important delivery.",
      "I got held up by a sudden online registration issue for my work credentials.",
      "I had to step out to pick up an urgent item for my workspace.",
      "I was helping a colleague understand a complicated task and it took time.",
      "I had to troubleshoot a malfunctioning work laptop before I could get to work.",
      "My printer ran out of ink right when I needed to print documents.",
      "I had an unscheduled phone call regarding personal business.",
      "I was waiting for a delivery that couldn’t be rescheduled.",
      "I had a personal phone call that needed to be handled immediately.",
      "I couldn’t attend the meeting because I was managing some work-related communication.",
      "I had to coordinate with a third-party vendor for an urgent issue.",
      "I missed the meeting because I was assisting with a last-minute project.",
      "I had to attend a meeting that ran over time.",
      "I had some last-minute feedback to incorporate into a presentation.",
      "I had to address a sudden work issue that couldn’t be postponed.",
      "I couldn’t attend the meeting because I was fixing a software bug in my system.",
      "I was trying to fix a problem with the shared office calendar.",
      "I got delayed because I had to finish work for another department.",
      "I had to finish off some administrative work before I could start the task.",
      "I had to step out for a quick break, which extended a little longer than expected.",
      "I couldn’t get an urgent update from a colleague in time for the meeting.",
      "I was sorting through paperwork for an upcoming audit.",
      "I had a technical issue with logging into the project management tool.",
      "I had a quick personal task to attend to that delayed me briefly.",
      "I had to address a sudden issue with an office supply order."
    ],
    "Low": [
      "I misread the time for the meeting and showed up late.",
      "I was on the wrong call for the first 10 minutes.",
      "I was distracted by an office snack break and lost track of time.",
      "I thought I had more time to finish the task and ran out of it.",
      "I didn’t get my usual morning coffee, so I was a bit off-track.",
      "My lunch break got extended because I was talking to a colleague.",
      "I was caught up in a heated debate about chai versus coffee.",
      "I lost my notebook and had to scramble to find it before starting the meeting.",
      "I couldn’t get a cab because of the heavy rain.",
      "I was in a rush and forgot to check my calendar for the meeting.",
      "I missed the first few minutes of the meeting because I was on a call with my friend.",
      "I got distracted by a funny meme in the office chat.",
      "I was working on a task and forgot to mute myself on the call.",
      "I had to grab an extra coffee because I didn’t sleep well last night.",
      "I was stuck in a conversation with HR about an office event.",
      "I thought the meeting was tomorrow, not today!",
      "My headphone wire got tangled, and I lost a few minutes fixing it.",
      "I thought it was a virtual meeting, but it was in-person.",
      "I was trying to figure out why the printer wasn't working.",
      "My desktop was taking forever to boot up.",
      "I misplaced the meeting invite and had to search for it.",
      "I was checking emails and lost track of time.",
      "I couldn’t find my charger, so I was trying to conserve battery.",
      "I got distracted by an office game and lost track of time.",
      "I was deep in a report and forgot about the meeting time.",
      "I had to troubleshoot my Wi-Fi connection, and it took a while.",
      "I had to take a quick call from my family.",
      "I was catching up on some random office gossip.",
      "I was fixing a sticky keyboard before I could start working.",
      "I missed the meeting because I was running an impromptu office poll on snacks.",
      "I was waiting for an email that I thought would come sooner.",
      "My computer decided to update right when I needed to use it.",
      "I spilled water on my desk, and it took a while to clean it up.",
      "I was chatting with a colleague about the weekend cricket match.",
      "I didn’t hear the reminder notification for the meeting.",
      "I couldn’t find the report in my inbox and had to search for it.",
      "I couldn’t log into the work system because I typed the wrong password too many times.",
      "I accidentally joined the wrong video call and had to switch over.",
      "I thought the meeting was for a different department.",
      "I was running around looking for my ID card for security.",
      "I couldn’t find my pen, and I got a bit distracted looking for it.",
      "I was wrapping up another task and lost track of time.",
      "I was troubleshooting a sound issue with my speakers.",
      "I was on a phone call with my bank that ran longer than expected.",
      "I had to check in on a delivery that arrived late.",
      "I was chatting with someone in the office and didn’t realize the time.",
      "My internet was slow, so I had to refresh a few times to access the file.",
      "I was too focused on fixing my chair that squeaks.",
      "I was watching a funny video and lost track of time.",
      "I was busy handling a minor issue in the office pantry.",
      "I missed the meeting because I was picking out lunch.",
      "I accidentally clicked the wrong link and ended up in a different meeting.",
      "I was organizing my desk and couldn’t find the documents I needed.",
      "I forgot to bring my lunch and had to step out to get food.",
      "I couldn’t find a parking spot and got delayed.",
      "I lost my phone and had to find it before starting work.",
      "I was working on a report and lost track of time while checking details.",
      "I didn’t realize the meeting was already in progress.",
      "I was trying to figure out how to set up a new software update.",
      "I took a short break to check social media and lost track of time.",
      "I was helping a colleague with a non-urgent task and got sidetracked.",
      "I didn’t see the reminder pop-up for the meeting.",
      "I was finishing up my morning routine and lost track of time.",
      "I was listening to a podcast and forgot about the meeting.",
      "I had a quick call with my friend and got delayed.",
      "I got caught up in a discussion about an office event.",
      "I was fixing a broken mouse, which took longer than expected.",
      "I couldn’t connect to the meeting because of a software glitch.",
      "I was so involved in my work that I didn’t realize the time.",
      "I had to call the IT team to fix my computer.",
      "I got distracted by a colleague who needed help with a simple task.",
      "I couldn’t find the meeting link in my inbox.",
      "I was re-arranging my workspace and lost track of time.",
      "I had to deal with an urgent but non-work-related issue at home.",
      "I couldn’t make it on time because I was having trouble with my mic.",
      "I didn’t realize my laptop battery was almost dead.",
      "I had to take care of some household chores quickly.",
      "I was trying to fix the office Wi-Fi connection.",
      "I was too busy replying to emails and missed the meeting.",
      "I was going over some last-minute changes to the project.",
      "I was on another call and couldn’t wrap it up in time.",
      "I didn’t have a charger with me and couldn’t attend the meeting.",
      "I had to organize my thoughts before the meeting and lost track of time.",
      "I was confused about the meeting time zone.",
      "I was trying to remember which document I needed for the meeting.",
      "I got delayed by a phone call about personal matters.",
      "I had to step out to pick up something urgently.",
      "I was finishing a minor task and forgot about the meeting."
    ]
  },
    "School/College": {
      "High": [
      "I was experiencing severe anxiety and couldn’t attend class.",
      "I had a family emergency and needed to handle it immediately.",
      "I had to deal with a medical issue that required urgent attention.",
      "I was stuck in a traffic jam for hours and couldn’t make it on time.",
      "I had a sudden power outage at home and couldn't access the study material.",
      "I had a severe headache and couldn’t focus on my studies.",
      "My parents were in a crisis, and I had to attend to them immediately.",
      "I was feeling unwell and had to take rest for my health.",
      "I was locked out of the campus library and couldn’t access the resources.",
      "I had to take care of a sick family member and couldn't attend class.",
      "I was involved in an accident on my way to class.",
      "My car broke down, and I had to wait for a mechanic to fix it.",
      "I had a doctor's appointment that I couldn’t reschedule.",
      "I was dealing with severe anxiety and couldn’t attend class today.",
      "I had a last-minute responsibility at home that I couldn’t avoid.",
      "I received a call about a serious situation at home.",
      "I couldn’t find my ID card and was unable to get into campus.",
      "I had an important legal matter to attend to and missed the class.",
      "I had to stay back to deal with an emergency situation at home.",
      "My phone broke, and I couldn't get any important updates for the class.",
      "I had to attend an urgent family gathering that couldn’t be missed.",
      "I was facing a mental health crisis and couldn’t come to class.",
      "I was caught up in a serious traffic accident and couldn't attend.",
      "I couldn’t attend due to a personal health issue that required immediate treatment.",
      "My house was flooded, and I had to deal with the aftermath immediately.",
      "I was dealing with a major issue regarding my residence and couldn’t leave.",
      "I missed the class because I was at the hospital for an emergency.",
      "I had to rush to a relative’s funeral and couldn’t make it to class.",
      "I had a significant health issue and needed immediate attention.",
      "My family had an unexpected crisis, and I had to handle it.",
      "I had a surgery scheduled that I couldn’t delay.",
      "I was in an emergency meeting at home with my parents and couldn’t attend class.",
      "I had to take an urgent leave for a personal matter that required my presence.",
      "I couldn’t come because I was dealing with an unexpected tragedy in the family.",
      "I had to leave urgently due to an unforeseen family problem.",
      "I was caught in a situation with my landlord that needed immediate attention.",
      "I had to be present for an urgent financial matter at home.",
      "I was going through a mental health issue and needed to take a break.",
      "I missed class due to being in a medical emergency at home.",
      "I was dealing with a close relative who fell seriously ill and couldn’t attend.",
      "My flight was delayed, and I missed the entire class.",
      "I had to go to the police station to file a report regarding a personal issue.",
      "I had to attend a close relative’s marriage and couldn’t make it to class.",
      "I had an emergency at my part-time job and couldn’t make it.",
      "I was at the hospital and couldn’t attend because of a health check-up.",
      "I was having severe stomach issues and couldn't make it to class.",
      "I had to run an urgent errand for my family and couldn’t attend class.",
      "I was feeling overwhelmed and couldn’t concentrate on my studies.",
      "I was attending to a sudden crisis involving my parents and couldn’t make it.",
      "I had a sudden fever and couldn't attend class.",
      "I was helping a family member with a serious legal matter.",
      "My father had a medical emergency, and I had to take care of him.",
      "I was caught in unexpected rain and couldn’t find a way to get to class.",
      "I had a migraine and couldn't attend class.",
      "I had a personal emergency with a close friend that I had to attend to.",
      "My relative passed away unexpectedly, and I couldn’t attend.",
      "I was dealing with an urgent situation with my hostel manager and couldn’t attend.",
      "I couldn’t attend because of a sudden urgent issue at my internship.",
      "I had a crisis at home that needed immediate attention and missed class.",
      "I had a severe allergic reaction and needed immediate treatment.",
      "I was caught in a legal matter and couldn’t attend class.",
      "I was helping my sibling with an important issue and couldn’t make it.",
      "I had to deal with an important personal document issue and couldn’t attend class.",
      "I had to attend a court session related to my family’s issue.",
      "I was at the hospital with my parent for their medical procedure.",
      "I had a medical appointment that I couldn’t miss.",
      "I had to make an emergency trip to the bank for an urgent matter.",
      "My mother had an accident, and I had to attend to her immediately.",
      "I couldn’t attend due to a death in the family.",
      "I had to take care of an important legal matter that required my immediate presence.",
      "I missed class due to a severe physical injury.",
      "I was in a long line for an urgent government-related issue and couldn’t attend.",
      "I had to cancel my trip to the university because of a family emergency.",
      "I couldn’t attend because I had to deal with a personal crisis.",
      "I had an emergency at home that required my immediate attention.",
      "I missed class because of a sudden financial issue that needed to be resolved immediately.",
      "I was unable to attend class because of a personal breakdown.",
      "I had to step out to take care of a legal matter at the last minute.",
      "I was in a very important family function that I couldn’t skip.",
      "I was in the middle of a home maintenance emergency.",
      "I had an important call with my family that I couldn’t postpone.",
      "I had an important ceremony at home and couldn’t make it to class.",
      "I had a sudden health issue and couldn’t attend.",
      "I was caught up in a traffic jam caused by a major accident and couldn’t make it.",
      "I had to deal with an urgent housing issue.",
      "I couldn’t attend because I had to resolve an important personal matter."
    ],
    "Medium": [
      "I was feeling too stressed and couldn’t focus on my work.",
      "I got caught in traffic due to a local festival and couldn’t make it.",
      "I had to attend to something urgent at home and missed the class.",
      "I mixed up the dates and didn’t realize there was a class today.",
      "I had an online class scheduled, and the internet connection wasn’t stable.",
      "My printer ran out of ink while I was printing my assignment.",
      "I couldn’t get a seat in the bus and was delayed because of it.",
      "I had to wait for an important phone call, and it took longer than expected.",
      "I was at a wedding ceremony, and it went longer than I expected.",
      "I overslept after studying late last night for exams.",
      "I was caught up in an unexpected work assignment and couldn't make it on time.",
      "I couldn’t find my bus pass and had to search for it before leaving.",
      "My friend needed help with a personal issue, and I couldn’t say no.",
      "I accidentally set my alarm for the wrong time and woke up late.",
      "I was finishing up an important project and lost track of time.",
      "I had to help my friend move out of the hostel and missed the class.",
      "I had to take an unplanned detour due to a road blockage.",
      "I had a small family function to attend, and I didn’t want to miss it.",
      "My phone broke down, and I was unable to receive updates for the class.",
      "I was organizing my notes and couldn’t finish in time to attend the class.",
      "I had to resolve a banking issue and missed the class by a few minutes.",
      "I wasn’t feeling well after eating something from the hostel mess.",
      "I was on a call with my parents and couldn’t leave for class immediately.",
      "I lost track of time while studying and couldn’t make it to the class.",
      "I missed the class because of a sudden change in my schedule.",
      "I was at a health clinic for a routine check-up and couldn’t attend.",
      "I accidentally closed the tab for the online class and couldn't log back in.",
      "I got caught up in work at my part-time job and couldn’t attend.",
      "I had to go to the market for something my family urgently needed.",
      "I was helping a fellow student with their project and couldn’t make it on time.",
      "I couldn’t find my homework, so I spent time searching for it.",
      "I had to take an impromptu break to get some rest.",
      "I couldn’t attend the class because I misplaced my ID card.",
      "My pet was sick, and I had to take care of it before leaving.",
      "I was helping my neighbor with a personal issue and lost track of time.",
      "My roommate needed my help with something, and I couldn’t say no.",
      "I accidentally missed the class time because I was attending another meeting.",
      "I had a moment of mental fatigue and couldn’t focus on anything.",
      "I misplaced my notebook and had to spend time searching for it.",
      "I had to attend an emergency meeting with my project group, which ran over time.",
      "I couldn’t make it due to a minor misunderstanding about the class timings.",
      "I had an unexpected visit to the post office for an urgent parcel.",
      "My friend was going through a tough time, and I stayed back to support them.",
      "I was helping my parents with some chores and couldn’t make it.",
      "I couldn’t attend because of a technical glitch while trying to log in online.",
      "I had to buy some important supplies and couldn’t make it on time.",
      "I didn’t receive any updates about the class schedule and missed it.",
      "I had to attend a last-minute student council meeting that ran over time.",
      "I was caught in an unexpected traffic jam caused by road repairs.",
      "I was working on an assignment and couldn’t get it done in time to attend class.",
      "I had to resolve an issue with my accommodation, and it took longer than expected.",
      "I couldn’t attend because I had to rush to meet with a tutor for extra help.",
      "I stayed up late finishing a project and couldn’t get up in time for class.",
      "I had to take an important call from my family and missed the class.",
      "I couldn’t attend because of a technical issue with my laptop.",
      "I got distracted by something on my phone and lost track of time.",
      "I had an important meeting with a mentor and couldn’t leave early.",
      "I had to wait for a delivery, and it arrived later than expected.",
      "I lost my wallet and had to search for it, which made me late for class.",
      "I had to attend to a personal emergency at the last moment.",
      "I missed the class because I was in the middle of a practical exam.",
      "I had to resolve an issue with my classmate’s group project, and it took longer.",
      "I was busy preparing for a presentation and missed the class.",
      "I didn’t realize the class was rescheduled and showed up late.",
      "I had an unexpected visitor at home and couldn’t leave on time.",
      "I was caught up in a long queue for my travel ticket and couldn’t make it.",
      "I had a part-time job shift that I couldn’t get out of.",
      "I was delayed because I couldn’t find parking near the college.",
      "I was doing some research for a project and lost track of time.",
      "I forgot to check my timetable and missed the class.",
      "I had to assist my friend with a personal matter and missed the class.",
      "I was attending a workshop that ran longer than expected.",
      "I couldn’t attend because I was involved in a campus event.",
      "I got stuck in a queue at the cafeteria and lost track of time.",
      "I was in a group discussion that went on longer than planned.",
      "I had to pick up a prescription for my mother and couldn’t make it on time.",
      "I was dealing with an urgent document verification issue at the bank.",
      "I couldn’t make it because I was working on a joint assignment.",
      "I had to spend extra time completing some classwork before coming to class.",
      "I was doing an internship assignment and couldn’t attend.",
      "I had to catch up on some important emails and missed the class.",
      "I couldn’t attend because I was in the middle of a peer review session.",
      "I had to make a last-minute change in my project and couldn’t leave.",
      "I had an online meeting with a mentor and couldn’t attend the class.",
      "I had a personal issue at home that required immediate attention.",
      "I couldn’t attend because of the sudden cancellation of the bus.",
      "I was in the middle of completing a project that had a tight deadline.",
      "I had a breakdown during my morning routine and couldn’t gather myself in time.",
      "I missed the class because I was distracted by an unexpected call from home.",
      "I was stuck in the elevator for a few minutes, which delayed me.",
      "I couldn’t attend because I was waiting for some important documents to arrive.",
      "I had to assist my family with a sudden errand that I couldn’t skip."
    ],
    "Low": [
      "I forgot to charge my laptop, and it died right before class.",
      "I couldn’t find my pen, so I was late to class.",
      "My notebook fell apart during class, and I had to fix it.",
      "I was running late because I had to find my ID card.",
      "I missed the bus and had to take an auto rickshaw.",
      "My uniform wasn’t ironed, and I had to do it before I left.",
      "I was stuck in a long queue for the canteen and missed the class.",
      "My shoes were untied, and I had to fix them before going.",
      "I got distracted by a meme and lost track of time.",
      "I was fixing my hairstyle and got a little carried away.",
      "I missed the class because I had to search for my homework.",
      "I couldn't find my umbrella, so I was late because of the rain.",
      "I had to stop at the photocopy shop and got delayed.",
      "I was busy with some last-minute cramming for the test.",
      "I accidentally locked my keys inside the room and had to call for help.",
      "My friend borrowed my notes, and I had to get them back.",
      "I didn’t have time to pack lunch and had to go back home.",
      "I lost track of time while watching a show on Netflix.",
      "I couldn’t find my glasses, and I had to search everywhere for them.",
      "I had to make a quick stop at the store and got delayed.",
      "I got into a small argument with my friend and it took longer than I expected.",
      "I couldn’t find my timetable, so I didn’t know the class time.",
      "I had to finish watching a video for a class, and I got delayed.",
      "I was making chai and lost track of time.",
      "I was waiting for my roommate to get ready, and I ended up being late.",
      "I couldn’t find a good parking spot and had to park far away.",
      "I was looking for my missing socks and lost track of time.",
      "I forgot to set my alarm for the morning, so I woke up late.",
      "I had to finish a snack before leaving for class and got delayed.",
      "I couldn’t find my charger, and my phone died while I was waiting for the bus.",
      "I was sorting out my bag and lost track of time.",
      "I didn’t realize the class had started, and I got there late.",
      "I had to take a detour to avoid the crowded roads.",
      "I was busy helping a friend with their homework and lost track of time.",
      "I was finishing a social media post and lost track of time.",
      "I accidentally knocked over my water bottle, and I had to clean it up.",
      "I couldn’t find my bus pass, and I had to look for it.",
      "I missed the class because I was watching a YouTube video.",
      "I had to take a quick nap after waking up late and missed the bus.",
      "I couldn’t find my earphones, and I spent time looking for them.",
      "I was scrolling through Instagram and didn’t realize the time.",
      "I was late because my friend borrowed my notes and didn’t return them on time.",
      "I was watching the cricket match highlights and got late.",
      "I had to search for my wallet and missed the bus.",
      "I couldn’t find the right outfit to wear, so I took longer than expected.",
      "I had to clean my shoes before leaving, which made me late.",
      "I got stuck in a conversation with a classmate and lost track of time.",
      "I was checking my phone and got distracted.",
      "I was trying to fix my laptop charger, and it delayed me.",
      "I got caught in a traffic jam because of a local wedding procession.",
      "I was caught up in a long phone call with my friend and missed the class.",
      "I had to grab some snacks for class and got delayed.",
      "I was helping my roommate find something and got delayed.",
      "I was looking for my hairbrush and couldn’t find it.",
      "I was busy with my part-time job and lost track of time.",
      "I couldn’t find a comfortable seat in the class and had to search for one.",
      "I was on my way but got distracted by the street food stall.",
      "I got late because I couldn’t find a rickshaw.",
      "I had to finish up some work before heading to class.",
      "I couldn’t find the right book for the lecture, so I got delayed.",
      "I was fixing my bike and it took longer than expected.",
      "I was getting ready but couldn’t find my watch.",
      "I lost my pen and had to go back to find it.",
      "I was fixing my laptop and missed the bus.",
      "I had to attend to a sudden personal matter and couldn’t leave on time.",
      "I was watching the news and lost track of time.",
      "I got a little carried away with my morning routine.",
      "I was looking for my slippers and couldn’t find them.",
      "I had to pack my lunch and missed the bus.",
      "I got distracted by a funny video and lost track of time.",
      "I had to go to the bank to deposit money for fees.",
      "I had to stop and buy a notebook, which delayed me.",
      "I was getting late and had to hurry, so I forgot my assignment.",
      "I was planning my day and lost track of time.",
      "I couldn’t find a place to park my bike and got delayed.",
      "I was checking my emails and didn’t realize how late it got.",
      "I had to finish a quick assignment before leaving.",
      "I had to fix my shoes, and it delayed me.",
      "I was waiting for a friend to finish getting ready.",
      "I forgot to bring my lunch, so I had to go back to get it.",
      "I was on the phone with my family and lost track of time.",
      "I was reading a message and didn’t realize the time.",
      "I was too tired from yesterday and woke up late.",
      "I couldn’t find the right socks and was late because of it.",
      "I was too focused on a puzzle game and missed the class.",
      "I was organizing my notes for class and lost track of time.",
      "I had to rush out of the house, so I forgot to pack my bag.",
      "I had to deal with some last-minute assignment submission issues.",
      "I was trying to get a good seat in class, so I was a little late.",
      "I was lost in thought while getting ready and couldn’t make it on time.",
      "I had to go to the bank and missed the class.",
      "I was distracted by a conversation and got late.",
      "I couldn’t find my headphones and was looking for them.",
      "I got delayed because of the heavy rain and had to wait for the bus.",
      "I had to sort out my study materials, which made me late.",
      "I had to stop by a friend's place to pick something up.",
      "I lost track of time because I was doing my morning workout.",
      "I couldn’t find a good place to sit in the bus, so I was late.",
      "I couldn’t find my keys, and I was running late because of it.",
      "I was listening to a podcast and got distracted.",
      "I was too comfortable in bed and overslept.",
      "I had to finish my breakfast and got delayed.",
      "I had to pick up a book I left in the library and got delayed.",
      "I was fixing my phone and didn’t realize the time."
    ]
  }
}
